{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [],
    "normalizer": null,
    "pre_tokenizer": null,
    "post_processor": null,
    "decoder": null,
    "model": {
      "type": "WordLevel",
      "vocab": {
        "HLA class I": 0,
        "HLA-A*02:01": 1,
        "HLA-A*03:01": 2,
        "HLA-A*02": 3,
        "HLA-A*11:01": 4,
        "HLA-B*07:02": 5,
        "HLA-B*08:01": 6,
        "HLA-A*01:01": 7,
        "Mamu-A*01": 8,
        "H-2Kb": 9,
        "HLA-DRA*01": 10,
        "H-2Db": 11,
        "HLA-A*24:02": 12,
        "HLA-DRA*01:01": 13,
        "HLA-DQA1*05:01/DQB1*02:01": 14,
        "HLA-B*57:01": 15,
        "HLA-B*27": 16,
        "HLA-B*35:01": 17,
        "HLA-DRB1*15:01": 18,
        "HLA-B*44": 19,
        "HLA-DRB1*04:01": 20,
        "HLA class II": 21,
        "HLA-B*27:05": 22,
        "HLA-B*08": 23,
        "HLA-DRA1*01": 24,
        "HLA-B*42:01": 25,
        "HLA-DQA1*01:02/DQB1*06:02": 26,
        "HLA-A*68:01": 27,
        "HLA-A2": 28,
        "HLA-B*57": 29,
        "HLA-B*15:01": 30,
        "HLA-DRB1*07:01": 31,
        "HLA-B*44:03:08": 32,
        "HLA-B*44:03": 33,
        "HLA-DRB1*01:01": 34,
        "HLA-DRA*01:01/DRB1*01:01": 35,
        "HLA-DPw2": 36,
        "<MIS>": 37,
        "HLA-B*37:01": 38,
        "HLA-DRB1*14:02": 39,
        "HLA-DR": 40,
        "HLA-B*35:08": 41,
        "HLA-A*02:01:48": 42,
        "HLA-C*07:02": 43,
        "HLA-A*80:01": 44,
        "HLA-DRB1*11:01": 45,
        "HLA-B27": 46,
        "HLA-A*08:01": 47,
        "HLA-A11": 48,
        "HLA-DQ": 49,
        "HLA-A*01": 50,
        "HLA-DQB1*06:02": 51,
        "H-2Kd": 52,
        "HLA-DRB3*03:01": 53,
        "HLA-B*51:01": 54
      },
      "unk_token": "<MIS>"
    }
  }