{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [
      {
        "id": 1,
        "content": "<PAD>",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 2,
        "content": "<EOS>",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 3,
        "content": "<CLS>",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 4,
        "content": "<MIS>",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      },
      {
        "id": 5,
        "content": "L",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 6,
        "content": "A",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 7,
        "content": "G",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 8,
        "content": "V",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 9,
        "content": "E",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 10,
        "content": "S",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id":11,
        "content": "I",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 12,
        "content": "K",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 13,
        "content": "R",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 14,
        "content": "D",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 15,
        "content": "T",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 16,
        "content": "P",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 17,
        "content": "N",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 18,
        "content": "Q",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 19,
        "content": "F",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 20,
        "content": "Y",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 21,
        "content": "M",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 22,
        "content": "H",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 23,
        "content": "C",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 24,
        "content": "W",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 25,
        "content": "B",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 26,
        "content": "O",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 25,
        "content": "U",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 27,
        "content": "Z",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": true,
        "special": false
      },
      {
        "id": 28,
        "content": "<MASK>",
        "single_word": false,
        "lstrip": false,
        "rstrip": false,
        "normalized": false,
        "special": true
      }
    ],
    "normalizer": {
      "type": "Sequence",
      "normalizers": [
        {
          "type": "Replace",
          "pattern": {
            "String": "X"
          },
          "content": "L"
        },
        {
          "type": "Replace",
          "pattern": {
            "String": "B"
          },
          "content": "D"
        },
        {
          "type": "Replace",
          "pattern": {
            "String": "Z"
          },
          "content": "E"
        },
        {
          "type": "Replace",
          "pattern": {
            "String": "J"
          },
          "content": "L"
        }
      ]
    },
    "pre_tokenizer": null,
    "post_processor": {
      "type": "TemplateProcessing",
      "single": [
        {
          "Sequence": {
            "id": "A",
            "type_id": 0
          }
        },
        {
          "SpecialToken": {
            "id": "<EOS>",
            "type_id": 0
          }
        }
      ],
      "pair": [
        {
          "Sequence": {
            "id": "A",
            "type_id": 0
          }
        },
        {
          "Sequence": {
            "id": "B",
            "type_id": 1
          }
        }
      ],
      "special_tokens": {
        "<EOS>": {
          "id": "<EOS>",
          "ids": [
            2
          ],
          "tokens": [
            "<EOS>"
          ]
        }
      }
    },
    "decoder": null,
    "model": {
      "type": "Unigram",
      "unk_id": 0,
      "vocab": [
        [
          "<unk>",
          0.0
        ]
      ]
    }
  }