{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [],
    "normalizer": null,
    "pre_tokenizer": null,
    "post_processor": null,
    "decoder": null,
    "model": {
      "type": "WordLevel",
      "vocab": {
        "<MIS>": 0,
        "HLA-A*02:01": 1
      },
      "unk_token": "<MIS>"
    }
  }